/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gtsuchid <gtsuchid@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/04/23 15:10:59 by gtsuchid          #+#    #+#             */
/*   Updated: 2024/04/23 15:24:21 by gtsuchid         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
// int main() {
//     // 標準出力に 'A' を出力
//     ft_putchar_fd('A', 1);  
//     write(1, "\n", 1);  // 改行を出力
//     // 標準エラー出力に 'B' を出力
//     ft_putchar_fd('B', 2);
//     write(2, "\n", 1);  // 改行を出力
//     return 0;
// }
